// 문제01 : 가격이 10만 원 이상인 첫 번째 상품을 찾아 출력하시오 – find().

// 문제02 : 카테고리가 "clothing"인 상품들만 골라 새로운 배열을 만드시오. – filter()

// 문제03 : 모든 상품 이름만 추출하여 배열로 만드시오. – map()

// 문제04 : 전자제품 중 100만 원 이상인 상품이 하나라도 있는지 확인하시오. fiter(), some()

// 문제05 : 모든 상품이 가격 2만 원 이상인지 확인하시오. - every()

// 문제 06 : 상품들의 총합 금액을 구하시오. - reduce() 사용, price 누적

// 문제07 : 상품 가격 기준으로 오름차순 정렬된 배열을 만들되, 원본 배열도 변경되게 하시오.
// - sort() (주의: 원본 배열 변경됨)

// 문제08 : 상품 이름을 기준으로 알파벳순으로 정렬하되, 원본 배열은 그대로 유지되게 하시오. - toSorted() , localeCompare()

// 문제09 : 상품 배열의 처음 3개만 잘라 새 배열로 반환하시오. - slice(start, end)

// 문제10 : 상품 배열에서 id가 3인 상품을 찾아 배열에서 제거하시오.

// – findIndex()와 splice() 조합
